{
  "backend/main.mo": "Main Motoko actor defining the comic platform's data types (Genre, Comic, Chapter, Comment, UserProfile) and CRUD operations for all entities, with role-based access control enforcing admin/user permissions.",
  "feature_evidence.json": "Feature evidence report documenting the refactoring of ChapterGrabbingPage.tsx to perform frontend-only HTML fetching via allorigins.win/corsproxy.io proxies with fallback logic, image preview grid, and existing backend mutation for saving.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend source files, describing the purpose and recent changes of each component, page, hook, and utility in the project.",
  "frontend/index.css": "Global Tailwind CSS entry point defining CSS custom properties for light and dark theme color tokens (background, foreground, primary, sidebar, chart colors, etc.).",
  "frontend/index.html": "Minimal HTML shell for the KOMIKU React app, mounting the root div and loading the main TypeScript module.",
  "frontend/src/App.tsx": "Root React application component that defines the full TanStack Router route tree for public pages (home, browse, comic detail, chapter reader) and admin pages (dashboard, comics, chapters, genres, comments, chapter grabbing).",
  "frontend/src/components/admin/AdminLayout.tsx": "Admin panel layout with a sidebar navigation, authentication guard, and a claim-admin flow for first-time setup; wraps admin page content.",
  "frontend/src/components/ComicCard.tsx": "Reusable comic card component displaying cover image with type/status badges, hover overlay with description, and author/view count info, linking to the comic detail page.",
  "frontend/src/components/CommentSection.tsx": "React component that renders a comment section for a given chapter, supporting login via Internet Identity, username setup, posting comments, and deleting owned comments.",
  "frontend/src/components/Layout.tsx": "Wrapper layout component that includes the Navigation header and a footer with branding, wrapping page content via children.",
  "frontend/src/components/Navigation.tsx": "Top navigation bar with logo, nav links, search form, and Internet Identity login/logout controls including principal ID display and copy functionality.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor (authenticated or anonymous) using React Query, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider context and useInternetIdentity hook for managing ICP Internet Identity authentication state, login, and logout via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Centralizes all React Query hooks (queries and mutations) for interacting with the backend actor, covering genres, comics, chapters, comments, and user profiles.",
  "frontend/src/index.css": "Global stylesheet that imports Google Fonts (Bangers, Nunito), sets up Tailwind directives, defines CSS custom properties for the dark theme using OKLCH color values, and adds utility classes for font display, line clamping, and thin scrollbars.",
  "frontend/src/main.tsx": "React app entry point that mounts the app with QueryClientProvider for React Query and InternetIdentityProvider for ICP authentication wrapping the root App component.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Admin dashboard page displaying stat cards for total comics, chapters, pages, and genres, plus quick-action buttons linking to admin sub-pages for managing content.",
  "frontend/src/pages/admin/ChapterGrabbingPage.tsx": "Admin page that fetches a comic chapter page via CORS proxies, extracts image URLs from the HTML, allows drag-and-drop reordering/removal of grabbed pages, and saves the result as a new chapter.",
  "frontend/src/pages/admin/ChapterManagementPage.tsx": "Admin page for managing chapters per comic, supporting create, edit, and delete operations through a form that accepts chapter number, title, and page URLs.",
  "frontend/src/pages/admin/ComicManagementPage.tsx": "Admin page for managing comics with full CRUD operations, including a searchable list and a form for title, description, cover image, type, status, author, artist, and genre selection.",
  "frontend/src/pages/admin/CommentModerationPage.tsx": "Admin page that lists all comments across chapters with search filtering by username or text, and allows moderators to delete individual comments.",
  "frontend/src/pages/admin/GenreManagementPage.tsx": "Admin page for managing comic genres, providing a form to add new genres with duplicate checking and a list view with delete functionality.",
  "frontend/src/pages/BrowsePage.tsx": "Browse/search page that allows users to filter comics by search query, genre, type, and status using dropdowns and a search form, displaying results via ComicCard components with loading skeletons.",
  "frontend/src/pages/ChapterReaderPage.tsx": "Comic chapter reader page supporting both scroll and paginated reading modes, with navigation between previous/next chapters, page controls, and a comment section below the reader.",
  "frontend/src/pages/ComicDetailPage.tsx": "Comic detail page showing cover image, metadata (type, author, genres, status), description, and a sorted chapter list with links to read each chapter.",
  "frontend/src/pages/HomePage.tsx": "Home page featuring a hero banner, genre filter pills, a latest-updated comics section, and a popular comics section, all fetched via React Query hooks and rendered with ComicCard components.",
  "frontend/src/utils/htmlParser.ts": "Extracts and scores manga/comic page image URLs from HTML strings using DOMParser (with regex fallback), filtering out icons/logos and ranking results by CDN patterns and numbered filenames.",
  "frontend/src/utils/proxyFetch.ts": "Fetches HTML content through CORS proxies, trying allorigins.win first and falling back to corsproxy.io, with a 15-second timeout on each attempt.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading URL query parameters (supporting both regular and hash-based routing), persisting them to sessionStorage, and cleaning sensitive params from the URL bar.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with dark mode, custom OKLCH-based color tokens, comic-themed fonts (Bangers, Nunito), glow shadows, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state snapshot for KOMIKU, an Indonesian comic platform, documenting version, features, architectural decisions (Internet Identity auth, frontend-side CORS proxy grabbing), and known issues."
}