{
  "backend/main.mo": "Main Motoko actor for the KOMIKU app defining data types (Comic, Chapter, Comment, Genre, UserProfile) and CRUD operations with role-based access control for admin and authenticated users.",
  "feature_evidence.json": "Feature evidence report declaring a single deployment promotion feature (no code changes) with associated components, test IDs, and high confidence.",
  "frontend-file-summaries.txt": "JSON map of frontend source files to short summaries describing recent changes, primarily Tailwind class fixes and minor bug corrections across pages and components.",
  "frontend/index.css": "Global Tailwind CSS entry point defining CSS custom property design tokens for light and dark themes including colors, radius, and sidebar variables.",
  "frontend/index.html": "Minimal HTML shell for the KOMIKU React app that mounts the root div and loads the main TypeScript module.",
  "frontend/src/App.tsx": "Root React component that configures TanStack Router with public and admin route trees, wrapping pages in their respective Layout or AdminLayout components.",
  "frontend/src/components/admin/AdminLayout.tsx": "Admin panel layout wrapper with a collapsible sidebar, nav items for admin sections, access control rendering, and logout functionality.",
  "frontend/src/components/ComicCard.tsx": "Reusable card component displaying a comic's cover image, type/status badges, hover description overlay, title, author, and view count as a navigable link.",
  "frontend/src/components/CommentSection.tsx": "Chapter comment section component handling authentication state, username setup modal, comment submission, and per-comment delete with ownership checks.",
  "frontend/src/components/Layout.tsx": "Public page layout wrapper that composes the Navigation bar, main content slot, and a footer with branding and a caffeine.ai attribution link.",
  "frontend/src/components/Navigation.tsx": "Top navigation bar component with logo, nav links, search form, and Internet Identity login/logout button, including an admin panel link for admin users.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an authenticated or anonymous ICP backend actor using React Query, reinitializing and invalidating dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider and useInternetIdentity hook for managing DFINITY Internet Identity authentication state, including login, logout, and identity persistence via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Centralizes all React Query hooks for fetching and mutating backend data (genres, comics, chapters, comments, user profiles, etc.) via the ICP actor.",
  "frontend/src/index.css": "Global stylesheet importing Google Fonts and defining Tailwind base/utility layers with a dark OKLCH color theme and custom utility classes for fonts, line clamping, and scrollbars.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrapping the root App component.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "An admin dashboard page displaying stat cards (comics, chapters, pages, genres counts) and quick-action buttons linking to admin management sub-pages.",
  "frontend/src/pages/admin/ChapterGrabbingPage.tsx": "Admin page that fetches a webpage URL, extracts image URLs from the HTML, allows drag-and-drop reordering/removal of grabbed pages, and saves them as a new chapter for a selected comic.",
  "frontend/src/pages/admin/ChapterManagementPage.tsx": "Admin page for managing chapters of a selected comic, supporting create, edit, and delete operations via a form with chapter number, title, and page URLs.",
  "frontend/src/pages/admin/ComicManagementPage.tsx": "Admin page for managing comics with search, create, edit, and delete functionality, including fields for title, description, cover image, type, status, author, artist, and genres.",
  "frontend/src/pages/admin/CommentModerationPage.tsx": "Admin page that lists all comments across chapters with search filtering by username or text, and allows moderators to delete individual comments.",
  "frontend/src/pages/admin/GenreManagementPage.tsx": "Admin page for managing comic genres, allowing creation of new genres and deletion of existing ones with duplicate-name validation.",
  "frontend/src/pages/BrowsePage.tsx": "A browse/search page that lets users filter comics by genre, type, status, and text search using query hooks, rendering results as ComicCard components with skeleton loading states.",
  "frontend/src/pages/ChapterReaderPage.tsx": "A chapter reader page supporting scroll and page-by-page read modes, with prev/next chapter navigation, page images display, and an embedded comment section.",
  "frontend/src/pages/ComicDetailPage.tsx": "A comic detail page showing cover image, metadata (type, status, genres, author), and a sorted chapter list with links to read each chapter.",
  "frontend/src/pages/HomePage.tsx": "The home page featuring a hero banner, genre filter pills, and sections for latest-updated and most-popular comics rendered as ComicCard grids with skeleton loading.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL parameters from both query strings and hash-based routing, with helpers to persist/retrieve values via sessionStorage and clean sensitive params from the URL bar.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining dark mode, custom fonts (Bangers, Nunito), OKLCH-based color tokens, border radius, box shadows, and animation keyframes for the frontend.",
  "project_state.json": "Project state snapshot (version 7) describing KOMIKU, an Indonesian manga/manhwa/manhua platform, listing its implemented features, architectural notes, and known issues."
}