{
  "backend/main.mo": "Main Motoko actor for the KOMIKU app defining data types (Comic, Chapter, Comment, Genre, UserProfile) and CRUD operations for all entities, with role-based access control (admin/user) enforced via AccessControl and MixinAuthorization mixins.",
  "feature_evidence.json": "Feature evidence report listing three high-confidence features related to fixing the 'actor not available' error in AdminLayout.tsx and useQueries.ts, including actor readiness checks and proper admin panel rendering after authentication.",
  "frontend-file-summaries.txt": "A JSON document containing one-line summaries of all frontend source files, describing the purpose and notable changes (e.g., Tailwind fixes, actor readiness guards) for each component, page, and hook.",
  "frontend/index.css": "Global CSS file that imports Tailwind directives and defines CSS custom properties for the design system's color tokens in both light and dark themes, including sidebar, chart, and semantic UI colors.",
  "frontend/index.html": "Minimal HTML entry point for the KOMIKU React app, mounting the app into a root div and loading the main TypeScript module.",
  "frontend/src/App.tsx": "Root React component that sets up TanStack Router with all public and admin routes, wrapping them in their respective Layout and AdminLayout components, and renders a global Toaster for notifications.",
  "frontend/src/components/admin/AdminLayout.tsx": "Admin panel layout with sidebar navigation, access control checks (login required, admin role), and a claim-admin flow for first-time setup.",
  "frontend/src/components/ComicCard.tsx": "Reusable comic card component displaying cover image, type/status badges, hover overlay with description, title, author, and view count, linking to the comic detail page.",
  "frontend/src/components/CommentSection.tsx": "React component that renders a comment section for a given chapter, supporting login via Internet Identity, username setup, posting comments, and deleting owned comments.",
  "frontend/src/components/Layout.tsx": "Wrapper layout component that includes the Navigation header and a footer with branding, wrapping page content via children.",
  "frontend/src/components/Navigation.tsx": "Sticky top navigation bar with logo, nav links, search form, and Internet Identity login/logout with principal ID display and copy functionality.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an authenticated or anonymous ICP backend actor using React Query, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider and useInternetIdentity hook for managing ICP Internet Identity authentication state, login, and logout via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for all backend interactions including CRUD operations for genres, comics, chapters, comments, user profiles, and admin management.",
  "frontend/src/index.css": "Global stylesheet that imports Google Fonts (Bangers, Nunito), sets up Tailwind directives, defines CSS custom properties for the dark theme color system using OKLCH, and adds utility classes for font display, line clamping, and thin scrollbars.",
  "frontend/src/main.tsx": "React app entry point that mounts the app with QueryClientProvider (React Query), InternetIdentityProvider, and renders the root App component.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Admin dashboard page showing stat cards (total comics, chapters, pages, genres) and quick-action buttons linking to admin sub-pages for managing content.",
  "frontend/src/pages/admin/ChapterGrabbingPage.tsx": "Admin page that fetches a comic chapter page via CORS proxies, extracts image URLs from the HTML, allows drag-and-drop reordering/removal of grabbed pages, and saves them as a new chapter.",
  "frontend/src/pages/admin/ChapterManagementPage.tsx": "Admin page for managing comic chapters, supporting create, edit, and delete operations on chapters for a selected comic, with a form for chapter number, title, and page URLs.",
  "frontend/src/pages/admin/ComicManagementPage.tsx": "Admin page for managing comics with full CRUD operations, including a searchable list and a form for title, description, cover image, type, status, author, artist, and genre selection.",
  "frontend/src/pages/admin/CommentModerationPage.tsx": "Admin page for moderating comments across all chapters, displaying comments grouped by chapter with search filtering and individual delete functionality.",
  "frontend/src/pages/admin/GenreManagementPage.tsx": "Admin page for managing comic genres, allowing creation of new genres and deletion of existing ones with duplicate-name validation.",
  "frontend/src/pages/BrowsePage.tsx": "Browse/search page that lets users filter comics by search query, genre, type, and status using dropdowns and a search form, displaying results via ComicCard components with loading skeletons.",
  "frontend/src/pages/ChapterReaderPage.tsx": "Comic chapter reader page supporting scroll and page-by-page read modes, with navigation between previous/next chapters, page controls, and a comment section below.",
  "frontend/src/pages/ComicDetailPage.tsx": "Comic detail page displaying cover image, metadata (type, author, genres, status), description, and a sorted chapter list with links to read each chapter.",
  "frontend/src/pages/HomePage.tsx": "Home page featuring a hero banner, horizontal genre filter pills, a latest-updated comics section, and a popular comics section, all driven by React Query hooks.",
  "frontend/src/utils/htmlParser.ts": "Extracts and scores manga/comic page image URLs from HTML strings using DOMParser (with regex fallback), filtering out icons/logos and ranking results by numbered filenames and CDN patterns.",
  "frontend/src/utils/proxyFetch.ts": "Fetches HTML content through CORS proxies, trying allorigins.win first and falling back to corsproxy.io, with a 15-second timeout on each attempt.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading URL query/hash parameters and persisting them in sessionStorage, including helpers to store, retrieve, clear, and strip sensitive params from the URL bar.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with dark mode, custom OKLCH-based color tokens, comic-themed fonts (Bangers, Nunito), glow shadows, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state document for KOMIKU, an Indonesian manga/comic web platform, tracking version, architecture notes (Internet Identity auth, CORS proxy grabbing), known issues (admin access race condition), and implemented features."
}