{
  "kind": "build_request",
  "title": "Fix 'actor not available' error on Claim Admin and admin panel content not rendering",
  "projectName": "KOMIKU",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-19",
      "text": "In AdminLayout.tsx, fix the 'actor not available' error when the Claim Admin button is clicked. Before calling the `claimAdmin` backend function, ensure the actor is fully initialized — add a readiness check or retry/await mechanism so that if the actor is not yet available, the call is deferred until it is ready. If the actor is still unavailable after retries, display a user-friendly error message instead of the raw 'actor not available' error.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-recent-6",
          "msg-recent-8"
        ],
        "quotes": [
          "Saat klik klaim admin muncul tulisan actor not available",
          "Error 'actor not available' saat tombol Claim Admin diklik — actor backend belum terinisialisasi saat fungsi claimAdmin dipanggil (race condition antara Internet Identity auth dan inisialisasi actor)"
        ]
      },
      "acceptanceCriteria": [
        "Clicking the 'Claim Admin' button no longer shows 'actor not available'",
        "The claimAdmin call waits until the backend actor is initialized before executing",
        "If actor initialization fails after retries, a friendly error message is displayed to the user",
        "The fix handles the race condition between Internet Identity authentication and actor initialization"
      ]
    },
    {
      "id": "REQ-20",
      "text": "In AdminLayout.tsx, fix the admin panel content not rendering after successful authentication. Ensure that after the admin principal status is confirmed (via `getAdminPrincipal`), the admin panel sidebar navigation and page content are rendered correctly. The admin panel should not remain blank or fail to show navigation links when the authenticated user is the admin.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-recent-6",
          "msg-recent-8"
        ],
        "quotes": [
          "Halaman admin ada, link menuju ke admin panel yang tidak muncul",
          "konten admin panel tidak muncul (link/tombol navigasi ke panel tidak tampil)"
        ]
      },
      "acceptanceCriteria": [
        "After logging in as admin via Internet Identity, the admin panel sidebar navigation links are visible",
        "Admin panel content (dashboard, comics, chapters, etc.) renders correctly after authentication",
        "The admin panel does not show a blank or empty state for authenticated admin users",
        "The Admin Panel link in the navbar correctly navigates to `/admin` and shows the full panel"
      ]
    },
    {
      "id": "REQ-21",
      "text": "In useQueries.ts or the actor initialization logic, ensure the backend actor instance is fully available before any mutation (such as `claimAdmin`) is invoked. Add a guard or loading state that blocks mutation calls until the actor from `useActor` is non-null, and expose a loading/ready state that AdminLayout.tsx can use to disable the Claim Admin button while the actor is still initializing.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-recent-8"
        ],
        "quotes": [
          "Race condition antara inisialisasi Internet Identity auth dan inisialisasi actor"
        ]
      },
      "acceptanceCriteria": [
        "The Claim Admin button is disabled or shows a loading indicator while the actor is not yet initialized",
        "No mutation is dispatched to the backend before the actor is ready",
        "Once the actor is initialized, the button becomes enabled and functions correctly"
      ]
    }
  ],
  "constraints": [
    "Do not modify files under frontend/src/hooks/useInternetIdentity.ts or frontend/src/hooks/useActor.ts — these are immutable",
    "Do not change the backend Motoko actor or its claimAdmin/getAdminPrincipal function signatures"
  ],
  "nonGoals": [
    "Changing the backend authorization logic or data model",
    "Redesigning the admin panel UI layout or styling",
    "Modifying the chapter grabbing functionality"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}